#+TITLE: Exercise 2.53
What would the interpreter print in response to evaluating each
of the following expressions?

#+begin_src scheme :results output
(define elems
  (list
   (list 'a 'b 'c)
   (list (list 'george))
   (cdr '((x1 x2) (y1 y2)))
   (cadr '((x1 x2) (y1 y2)))
   (pair? (car '(a short list)))
   (memq 'red '((red shoes) (blue socks)))
   (memq 'red '(red shoes blue socks))))

(for ([elem elems])
  (display elem)
  (display "\n"))
#+end_src

#+RESULTS:
: (a b c)
: ((george))
: ((y1 y2))
: (y1 y2)
: #f
: #f
: (red shoes blue socks)
